<?php

/**
 *    Redis缓存Key
 *
 * User: Redscarf
 * Last Modify: 17/6/19
 * Final Modifier: Redscarf
 */


return [

    /***********************
     *       业务的缓存      *
     ***********************/

    /**
    |--------------------------------------------------------------------------
    | 字符串 用于保存验证码
    |--------------------------------------------------------------------------
    | 作用： 根据发送过来的随机数获取 验证码
    | VALUE =  4位数验证码
     */
    'verify_code' => 'STRING:VERIFY_CODE:NUMBER:',



    /**
    |--------------------------------------------------------------------------
    | 签名哈希表   存储用户token信息
    |--------------------------------------------------------------------------
    | 作用： 根据token加密生成签名
    | VALUE =  token,tokenTime  表中每个文章的详细信息。
     */
    'tokenInfo' => 'HASH:DATA_STAFF_TOKEN:GUID:',

    /**
    |--------------------------------------------------------------------------
    | 签名哈希表   存储微信小程序用户token信息
    |--------------------------------------------------------------------------
    | 作用： 根据token加密生成签名
     */
    'wxTokenInfo' => 'HASH:DATA_STAFF_WXTOKEN:GUID:',

];
